![img](../data/images.png)

# TP2 Analyse de données  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2022_2023
-------

## Exercice 1 :
1. Importer la bibliothèque `sqlite3` et la bibliothèque `pandas` avec l'alias `pd`.

2. Créer une connection `conn` en pointant le fichier `customer_sales.db'` se trouvant dans le chemin `/data/source/ `. 

3. Créer le data frame **df_sales** à partir de la connection faite en a.
    
4. Donner l'index de **df_sales**.
    
5. Changer l'index de **df_sales** en `Sales_Id`.
    
6. Afficher les $2$ premières ligne du dataframe **df_sales**.
    
7. Inspecter les informations de **df_sales** ( utiliser `df.info` ). Y-a-t il des données manquantes?

8. Trier **df_sales** selon la colonne `Sale_date` par ordre croissant. Donner la description de l'achat le plus récent ?
9. Séléctionner toutes les données de **df_sales** tels que `['Sales_Amount'] > 100`.
10. Séléctionner toutes les données de **df_sales** tels que `['Sales_Quantity'] =1`.

### Réponse à la question 9 ( Code SQL)

* Installer `ipython-sql` avec la commande : 
```python
!pip install ipython-sql
``` 
* Exécuter dans une autre cellules
> ```python
%%capture
%load_ext sql
%sql sqlite:///customer_sales.db
```
* Puis
>```python
%%sql
select * from tbl_sales
where Sales_Amount > 100
```

In [25]:
%%capture
%load_ext sql
%sql sqlite:///customer_sales.db

In [37]:
%%sql
select * from tbl_sales
where Sales_Amount between 1 and 10

 * sqlite:///customer_sales.db
Done.

[(3, '6/14/2015', 'Internet Purchase', 3, 3, 5, 1),
 (8, '6/15/2018', 'Purchased from Store', 3, 3, 5, 1),
 (9, '5/25/2019', 'Internet Purchase', 1, 3, 10, 2),
 (10, '6/9/2019', 'Internet Purchase', 2, 3, 10, 2)]

### Espace résérvé à la correction 

* Q1

In [3]:
import sqlite3

In [4]:
import pandas as pd

* Q2

In [9]:
conn = sqlite3.connect('../data/source/customer_sales.db')

In [10]:
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('CLIENTS2',), ('tbl_customers3',), ('tbl_products',), ('tbl_sales',), ('tbl_customers',)]

* Q3

In [17]:
df_sales =  pd.read_sql_query("SELECT * FROM tbl_sales", conn,index_col='Sale_ID')
df_sales

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
1,12/31/2014,Purchased from Store,2,2,20,1
2,1/15/2015,Phone Purchase,1,1,30,2
3,6/14/2015,Internet Purchase,3,3,5,1
4,11/11/2015,Sales Convention Purchase,3,3,500,100
5,4/18/2016,Internet Purchase,4,1,20,2
6,10/15/2016,Purchased from Store,5,1,20,1
7,3/17/2017,Internet Purchase,4,1,20,1
8,6/15/2018,Purchased from Store,3,3,5,1
9,5/25/2019,Internet Purchase,1,3,10,2
10,6/9/2019,Internet Purchase,2,3,10,2

* Q4

In [13]:
df_sales.index

RangeIndex(start=0, stop=10, step=1)

* Q5

In [16]:
df_sales = df_sales.set_index('Sale_ID')
df_salespapassss

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
1,12/31/2014,Purchased from Store,2,2,20,1
2,1/15/2015,Phone Purchase,1,1,30,2
3,6/14/2015,Internet Purchase,3,3,5,1
4,11/11/2015,Sales Convention Purchase,3,3,500,100
5,4/18/2016,Internet Purchase,4,1,20,2
6,10/15/2016,Purchased from Store,5,1,20,1
7,3/17/2017,Internet Purchase,4,1,20,1
8,6/15/2018,Purchased from Store,3,3,5,1
9,5/25/2019,Internet Purchase,1,3,10,2
10,6/9/2019,Internet Purchase,2,3,10,2

* Q6

In [19]:
df_sales.head(2)
# afficher les deux premières lignes

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
1,12/31/2014,Purchased from Store,2,2,20,1
2,1/15/2015,Phone Purchase,1,1,30,2

* Q7

In [21]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 1 to 10
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Sale_Date       10 non-null     object
 1   Description     10 non-null     object
 2   Customer_ID     10 non-null     int64
 3   Product_ID      10 non-null     int64
 4   Sales_Amount    10 non-null     int64
 5   Sales_Quantity  10 non-null     int64
dtypes: int64(4), object(2)
memory usage: 560.0+ bytes

* Q8

In [24]:
df_sales['Sale_Date']=pd.to_datetime(df_sales['Sale_Date'])
# ordre décroissant
df_sales.sort_values(by = 'Sale_Date', ascending=False)
# ordre croissant
df_sales.sort_values(by = 'Sale_Date', ascending=True)

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
10,2019-06-09,Internet Purchase,2,3,10,2
9,2019-05-25,Internet Purchase,1,3,10,2
8,2018-06-15,Purchased from Store,3,3,5,1
7,2017-03-17,Internet Purchase,4,1,20,1
6,2016-10-15,Purchased from Store,5,1,20,1
5,2016-04-18,Internet Purchase,4,1,20,2
4,2015-11-11,Sales Convention Purchase,3,3,500,100
3,2015-06-14,Internet Purchase,3,3,5,1
2,2015-01-15,Phone Purchase,1,1,30,2
1,2014-12-31,Purchased from Store,2,2,20,1

* Q9

In [34]:
df_sales[(df_sales['Sales_Amount'] >1) & (df_sales['Sales_Amount'] <20) ]

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
3,2015-06-14,Internet Purchase,3,3,5,1
8,2018-06-15,Purchased from Store,3,3,5,1
9,2019-05-25,Internet Purchase,1,3,10,2
10,2019-06-09,Internet Purchase,2,3,10,2

* Q10

In [38]:
df_sales[df_sales['Sales_Quantity'] ==1 ]

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
1,2014-12-31,Purchased from Store,2,2,20,1
3,2015-06-14,Internet Purchase,3,3,5,1
6,2016-10-15,Purchased from Store,5,1,20,1
7,2017-03-17,Internet Purchase,4,1,20,1
8,2018-06-15,Purchased from Store,3,3,5,1

## EXERCICE 2 :

> * Corriger les erreurs éventuelles
> * Interpréter et commenter chaque ligne de code

In [39]:
import pandas as pd

In [44]:
df_user_churn_cleaned = pd.read_csv('../data/source/user_hits_binning_import.csv', parse_dates=['date'])

In [47]:
df_user_churn_cleaned.head(10)

   userid       date
0       1 2017-01-01
1       2 2017-01-02
2       3 2017-01-03
3       4 2018-01-01
4       5 2018-01-02
5       6 2018-10-03
6       1 2019-10-01
7       3 2019-10-02
8       7 2019-10-03
9       8 2020-01-01

In [48]:
from datetime import datetime
import numpy as np

In [57]:
df_user_churn_cleaned['age'] = (datetime.now() - pd.to_datetime(df_user_churn_cleaned['date'])).dt.days
# créer la colonne age contenant les ages associés à chaque user id

In [56]:
df_user_churn_cleaned

    userid       date   age
0        1 2017-01-01  2104
1        2 2017-01-02  2103
2        3 2017-01-03  2102
3        4 2018-01-01  1739
4        5 2018-01-02  1738
5        6 2018-10-03  1464
6        1 2019-10-01  1101
7        3 2019-10-02  1100
8        7 2019-10-03  1099
9        8 2020-01-01  1009
10       1 2020-01-02  1008
11       2 2020-01-03  1007

In [113]:
df_ages = df_user_churn_cleaned.groupby('userid').max()

In [114]:
df_ages

             date   age
userid
1      2020-01-02  2104
2      2020-01-03  2103
3      2019-10-02  2102
4      2018-01-01  1739
5      2018-01-02  1738
6      2018-10-03  1464
7      2019-10-03  1099
8      2020-01-01  1009

In [115]:
365*3

1095

In [116]:
df_ages['age_bin'] = pd.cut(x=df_ages['age'], bins=[1, 1094, 1825, 9999], labels=['< 3 year', '3 to 5 years', '> 5 years'])

In [117]:
#df_ages['age_by_decade'] = pd.cut(x=df_ages['age'], bins=[__, __, __], labels=['< 1 year', '1 to 2 years', '> 3 years'])

In [118]:
#df_user_churn_cleaned['day_of_week_in_number'] = pd.df_user_churn_cleaned['date'].dt.dayofweek

In [119]:
df_ages

             date   age       age_bin
userid
1      2020-01-02  2104     > 5 years
2      2020-01-03  2103     > 5 years
3      2019-10-02  2102     > 5 years
4      2018-01-01  1739  3 to 5 years
5      2018-01-02  1738  3 to 5 years
6      2018-10-03  1464  3 to 5 years
7      2019-10-03  1099  3 to 5 years
8      2020-01-01  1009      < 3 year

In [127]:
df_grouped = df_ages.groupby('age_bin').count()

In [128]:
df_grouped

              date  age
age_bin
< 3 year         1    1
3 to 5 years     4    4
> 5 years        3    3

In [129]:
df_grouped.drop(['date'], axis=1)
# df.drop(Liste de ligne ou de colonne , axis=1 ( colonne), ou axis=0 ( ligne))

              age
age_bin
< 3 year        1
3 to 5 years    4
> 5 years       3

In [130]:
df_grouped.rename(columns={'age': 'user count'}, inplace=True)

In [131]:
df_grouped

              date  user count
age_bin
< 3 year         1           1
3 to 5 years     4           4
> 5 years        3           3

In [132]:
df_grouped.drop(['date'], axis=1)

              user count
age_bin
< 3 year               1
3 to 5 years           4
> 5 years              3

|Commande | description|
|---------|------------|
|`df.drop(Liste , axis =1)`| Supprimer la liste des colonnes indiqués| 
|`df.drop(Liste , axis =0)`| Supprimer la liste des lignes indiqués|